app/controllers/articles_controller.rb

  def update
    a = Article.find(params[:id])
    a.title = params[:article][:title]
    a.description = params[:article][:description]
    a.save
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", nil], ["description", nil], ["updated_at", "2020-06-12 20:45:00.835310"], ["id", 1]]